# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

for i in range(int(input('Введите число N - '))):
    print((-3) ** i, end = ' ')

